# --- Core & System ---
brew "stow"
brew "chezmoi"
brew "git"
brew "git-lfs"
brew "wget"
brew "curl"
brew "cmake"
brew "llvm"

# --- Shell Essentials ---
brew "starship"
brew "zoxide"
brew "fzf"
brew "tmux"
cask "iterm2"

# --- Modern CLI Tools ---
brew "eza"          # Modern ls
brew "ripgrep"      # Fast grep
brew "git-delta"    # Better git diff (Recommended)
brew "bat"          # Modern cat with syntax highlighting (Recommended)
brew "fd"           # Fast find (Recommended)
brew "jq"           # JSON processor (Recommended)
brew "tldr"         # Simplified man pages (Recommended)
brew "tree"

# --- Development ---
brew "neovim"
brew "gh"           # GitHub CLI
brew "node"
brew "rust"
brew "python"       # Latest Stable Python
brew "uv"           # Fast Python installer
brew "pixi"         # Package management made easy

# --- AI & Data ---
brew "ollama"

# --- Fonts (Casks) ---
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
