# --- Core & System ---
brew "stow"
brew "chezmoi"
brew "git"
brew "git-lfs"
brew "wget"
brew "curl"
brew "cmake"
brew "llvm"

# --- Shell Essentials ---
brew "starship"
brew "zoxide"
brew "fzf"
brew "tmux"
cask "iterm2"

# =================================
# macOS-only CLI tools
# =================================
brew "mas"                    # Mac App Store CLI
brew "duti"                   # Set default applications
brew "trash"                  # Move files to trash instead of rm
brew "switchaudio-osx"        # Switch audio devices from CLI
brew "blueutil"               # Bluetooth CLI utility
brew "brightness"             # Control display brightness

# =================================
# macOS GUI Apps (Casks)
# =================================
cask "raycast"                # Spotlight replacement
cask "rectangle"              # Window management
cask "stats"                  # System monitor in menu bar
cask "hiddenbar"              # Hide menu bar icons
cask "aldente"                # Battery management
cask "appcleaner"             # App uninstaller
cask "the-unarchiver"         # Archive utility

# --- Modern CLI Tools ---
brew "eza"          # Modern ls
brew "ripgrep"      # Fast grep
brew "git-delta"    # Better git diff (Recommended)
brew "bat"          # Modern cat with syntax highlighting (Recommended)
brew "fd"           # Fast find (Recommended)
brew "jq"           # JSON processor (Recommended)
brew "tldr"         # Simplified man pages (Recommended)
brew "tree"

# --- Development ---
brew "neovim"
brew "gh"           # GitHub CLI
brew "node"
brew "rust"
brew "python"       # Latest Stable Python
brew "uv"           # Fast Python installer
brew "pixi"         # Package management made easy

# --- AI & Data ---
brew "ollama"

cask "monitorcontrol"         # External monitor brightness

# =================================
# Quick Look plugins
# =================================
cask "qlcolorcode"            # Syntax highlighting in Quick Look
cask "qlstephen"              # Plain text files without extension
cask "qlmarkdown"             # Markdown preview
cask "quicklook-json"         # JSON preview
cask "qlimagesize"            # Image dimensions in Quick Look

# --- Fonts (Casks) ---
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

